app/auth/authenticate_user.rb

  def user
    user = User.find_by_email(email.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "irfan4sial 1@gmail.com"], ["LIMIT", 1]]