app/controllers/api/v1/cardboard_types_controller.rb

SELECT "cardboard_types".* FROM "cardboard_types"
---
  def index
    @cardboard_types = CardboardType.all