app/controllers/api/v1/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = @current_user.orders.all

INSERT INTO "orders" ("quantity", "price", "discount", "shipping_fee", "total_price", "card_type", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    respond_to do |format|
      if @order.save!