app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "irfan"], ["email", "irfan@clustox.com"], ["password", "password"], ["created_at", "2020-07-02 20:21:05.677793"], ["updated_at", "2020-07-02 20:21:05.677793"]]
---
  def register
    @user = User.new(user_params)
    if @user.save